Autodesk.Revit.DB.PreviewFamilyVisibilityMode
Modes that control visibility of family elements depending on
the currently applied Element Visibility Settings of a view.
Remarks:
Values of this mode can be set or obtained for any view that supports it by accessing
the Autodesk::Revit::DB::TemporaryViewModes::PreviewFamilyVisibility
property.
Since:
2016 Subscription Update

Autodesk.Revit.DB.PreviewFamilyVisibilityMode.Uncut
Element Visibility of a view is applied to show elements visible if instance is not cut.
Note that this state is only available in certain views, such as floor plan and ceilings.

Autodesk.Revit.DB.PreviewFamilyVisibilityMode.On
Element Visibility of a view is applied to show visible elements only.
Elements that are cut by a reference plane will be shown with their respective cut geometry.

Autodesk.Revit.DB.PreviewFamilyVisibilityMode.Off
Element Visibility is not applied. All family elements visible.